# Pandas
Panda is a powerful tool(library) that is used for Data wrangling while extracting useful insights/information from raw data
It is an open source data analysis library written in Python
It provides rich and highly robust data operations
It leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientists

# Application of using Panda

In [3]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\alokg\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\alokg\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\alokg\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\alokg\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\alokg\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\alokg\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd
#pd stands for panda dataframes

In [18]:
data1 = {'name':['alok','anuj','ankit'],'age':['19','19','20'],'college':['pwioi','pwioi','pwioi']}

In [19]:
data1

{'name': ['alok', 'anuj', 'ankit'],
 'age': ['19', '19', '20'],
 'college': ['pwioi', 'pwioi', 'pwioi']}

In [20]:
type(data1)

dict

In [21]:
df=pd.DataFrame(data=data1)

In [22]:
df

    name age college
0   alok  19   pwioi
1   anuj  19   pwioi
2  ankit  20   pwioi

In [23]:
type(df)

pandas.core.frame.DataFrame

# Data Structures in Pandas
two types of data structures:
:-> DataFrames
:-> Series

# Data Frames
A 2-D data structure with columns of potentially different types of data.

# Series 
A 1-D array capable of holding any type of data.
                OR
Each column of dataframes is called series.

In [24]:
li = [2,3,4,5]

In [25]:
pd.Series(data = li)

0    2
1    3
2    4
3    5
dtype: int64

In [26]:
ages= pd.Series([22,54,34])

In [28]:
df['name']

0     alok
1     anuj
2    ankit
Name: name, dtype: object

In [29]:
df['age']

0    19
1    19
2    20
Name: age, dtype: object

In [30]:
pd.Series(data = li)

0    2
1    3
2    4
3    5
dtype: int64

In [31]:
df

    name age college
0   alok  19   pwioi
1   anuj  19   pwioi
2  ankit  20   pwioi

In [32]:
ages.max()

54

In [33]:
age.max()

NameError: name 'age' is not defined

In [34]:
df['age'].max()

'20'

In [35]:
ages.max()

54

In [ ]:
ages=pd.Series()

In [42]:
df['age'].agg()

ValueError: No objects to concatenate

In [43]:
df.describe()

        name age college
count      3   3       3
unique     3   2       1
top     alok  19   pwioi
freq       1   2       3

In [55]:
dataa= {'country' : ["Brazil", "Russia", "India", "China", "South Africa"],'capital' : ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"] , "area" : [8.516, 17.10, 3.286, 9.67, 2.98] ,'population' : [200.4, 143.5, 1252, 133, 4.3]}
brics=pd.DataFrame(data={'country': country, 'capital': capital,'area': area,'population': population})

NameError: name 'country' is not defined

In [50]:
d0

NameError: name 'd0' is not defined

In [51]:
dataa

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.67, 2.98],
 'population': [200.4, 143.5, 1252, 133, 4.3]}

In [52]:
df=pd.DataFrame(data=dataa)

In [53]:
df

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [54]:
brics=pd.DataFrame(data={'country': country, 'capital': capital,'area': area,'population': population})

NameError: name 'country' is not defined

In [56]:
df.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [57]:
df['area'].max()

17.1

In [58]:
df['area'].describe()

count     5.000000
mean      8.310400
std       5.762066
min       2.980000
25%       3.286000
50%       8.516000
75%       9.670000
max      17.100000
Name: area, dtype: float64

In [59]:
df['capital']

0     Brasilia
1       Moscow
2    New Delhi
3      Beijing
4     Pretoria
Name: capital, dtype: object

In [60]:
df['country']

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: country, dtype: object

In [61]:
df.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [62]:
#( ) ka use hua mtlb function
#() ka use nhi hua mtlb property

In [64]:
df.shape

(5, 4)

In [65]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [67]:
df.index= ['A','B','C','D','E']

In [68]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [69]:
df

        country    capital    area  population
A        Brazil   Brasilia   8.516       200.4
B        Russia     Moscow  17.100       143.5
C         India  New Delhi   3.286      1252.0
D         China    Beijing   9.670       133.0
E  South Africa   Pretoria   2.980         4.3

In [78]:
df.index(start=0, stop=5, step=1)

SyntaxError: cannot assign to literal (607250455.py, line 1)

In [79]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [80]:
df.index = range(1,10,2)

In [81]:
df

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [84]:
df.index = range(1,15,3)

In [85]:
df

         country    capital    area  population
1         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
7          India  New Delhi   3.286      1252.0
10         China    Beijing   9.670       133.0
13  South Africa   Pretoria   2.980         4.3

In [86]:
df

         country    capital    area  population
1         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
7          India  New Delhi   3.286      1252.0
10         China    Beijing   9.670       133.0
13  South Africa   Pretoria   2.980         4.3

In [88]:
df.index = range(1,6,1)

In [89]:
df

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
2        Russia     Moscow  17.100       143.5
3         India  New Delhi   3.286      1252.0
4         China    Beijing   9.670       133.0
5  South Africa   Pretoria   2.980         4.3

In [90]:
df.index

RangeIndex(start=1, stop=6, step=1)

In [92]:
df.index = range(1,11,2)

In [93]:
df

        country    capital    area  population
1        Brazil   Brasilia   8.516       200.4
3        Russia     Moscow  17.100       143.5
5         India  New Delhi   3.286      1252.0
7         China    Beijing   9.670       133.0
9  South Africa   Pretoria   2.980         4.3

In [94]:
df.index = range(2,11,2)

In [95]:
df

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [96]:
list(df.columns)

['country', 'capital', 'area', 'population']

In [97]:
df.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [98]:
df

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [99]:
df.dtypes

country        object
capital        object
area          float64
population    float64
dtype: object

In [100]:
df['country']

2           Brazil
4           Russia
6            India
8            China
10    South Africa
Name: country, dtype: object

In [101]:
df.country

2           Brazil
4           Russia
6            India
8            China
10    South Africa
Name: country, dtype: object

In [102]:
df.country.max()

'South Africa'

In [103]:
df.area.max()

17.1

In [104]:
df

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [109]:
df.reset_index()

   index       country    capital    area  population
0      2        Brazil   Brasilia   8.516       200.4
1      4        Russia     Moscow  17.100       143.5
2      6         India  New Delhi   3.286      1252.0
3      8         China    Beijing   9.670       133.0
4     10  South Africa   Pretoria   2.980         4.3

In [110]:
df

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [112]:
df.reset_index(inplace=True)

In [113]:
df

   index       country    capital    area  population
0      2        Brazil   Brasilia   8.516       200.4
1      4        Russia     Moscow  17.100       143.5
2      6         India  New Delhi   3.286      1252.0
3      8         China    Beijing   9.670       133.0
4     10  South Africa   Pretoria   2.980         4.3

In [114]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [115]:
df.drop

<bound method DataFrame.drop of    index       country    capital    area  population
0      2        Brazil   Brasilia   8.516       200.4
1      4        Russia     Moscow  17.100       143.5
2      6         India  New Delhi   3.286      1252.0
3      8         China    Beijing   9.670       133.0
4     10  South Africa   Pretoria   2.980         4.3>

In [116]:
df

   index       country    capital    area  population
0      2        Brazil   Brasilia   8.516       200.4
1      4        Russia     Moscow  17.100       143.5
2      6         India  New Delhi   3.286      1252.0
3      8         China    Beijing   9.670       133.0
4     10  South Africa   Pretoria   2.980         4.3

In [117]:
df['size_rank'] = [2,1,4,3,5]

In [118]:
df

   index       country    capital    area  population  size_rank
0      2        Brazil   Brasilia   8.516       200.4          2
1      4        Russia     Moscow  17.100       143.5          1
2      6         India  New Delhi   3.286      1252.0          4
3      8         China    Beijing   9.670       133.0          3
4     10  South Africa   Pretoria   2.980         4.3          5

In [1]:
import panda as pd

ModuleNotFoundError: No module named 'request'